In [35]:
for i in range(0,7):
    if i<5:
        print(i*'*','\n')
        i+=1
    elif i>5:
        for a in range(5,0,-1): 
            print (a*'*','\n')

*

**

***

****

*****

****

***

**

*

In [1]:

for i in range(0,9):
    if(i <= 4):
        for j in range(0,i+1):
            print("*", end=" ")
        print("\n")
    else:
        for j in range(i,9):
            print("*", end=" ")
        print("\n")

*

* *

* * *

* * * *

* * * * *

* * * *

* * *

* *

*

In [9]:
for a in range(5,0,-1): 
    print (a*'*')
    a=a+1

*****
****
***
**
*

#Assignment 6

In [1]:
"""#1 Some values in the the FlightNumber column are missing. These numbers are
meant to increase by 10 with each row so 10055 and 10075 need to be put in
place. Fill in these missing numbers and make the column an integer column
(instead of a float column)."""

'#1 Some values in the the FlightNumber column are missing. These numbers are\nmeant to increase by 10 with each row so 10055 and 10075 need to be put in\nplace. Fill in these missing numbers and make the column an integer column\n(instead of a float column).'

In [1]:
import pandas as pd
import numpy as np

In [2]:

df3 = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})
df3.head()

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [3]:
df3.iloc[0,1]

10045.0

In [4]:
a=range(len(df3['FlightNumber']))
a
for i in a:
    df3.iloc[i,1]=df3.iloc[0,1]+(i*10)
print(df3)
df3.dtypes
df3['FlightNumber']=df3['FlightNumber'].astype(int)

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [5]:
df3['From_To']=df3['From_To'].astype(str)
df3.dtypes
#d1.iloc[0][0]

From_To         object
FlightNumber     int32
RecentDelays    object
Airline         object
dtype: object

In [6]:




"""2. The From_To column would be better as two separate columns! Split each
string on the underscore delimiter _ to give a new temporary DataFrame with
the correct values. Assign the correct column names to this temporary
DataFrame"""

df4=df3['From_To']
df4
d1=df4.str.split(pat='_').str.get(0)
d2=df4.str.split(pat='_').str.get(1)
d2
#pd.DataFrame(d1)
#a=d1.iloc[0].split()
#a
#d1[0][0]
#newdf['From'].append(d1)

0        paris
1        miLAN
2    StockhOlm
3        PaRis
4       londOn
Name: From_To, dtype: object

In [8]:
"""3. Notice how the capitalisation of the city names is all mixed up in this
temporary DataFrame. Standardise the strings so that only the first letter is
uppercase (e.g. "londON" should become "London".)
"""
d2=d2.str.title()
d2
d2=pd.DataFrame(d2)
d2

     From_To
0      Paris
1      Milan
2  Stockholm
3      Paris
4     London

In [9]:
d2=d2.rename(columns={"From_To": "To"})
d1=d1.rename(columns={"From_To": "From"})
d1

       From
0    London
1    Madrid
2    London
3  Budapest
4  Brussels

In [10]:
"""4. Delete the From_To column from df and attach the temporary DataFrame
from the previous questions.
"""
df3.drop(["From_To"], axis=1, inplace=True)
df3
df3=pd.concat([df3,d1,d2],axis=1)
df3

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

In [11]:
df3["RecentDelays"][0][1]

47

In [12]:
df3

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

In [13]:
#df3['RecentDelays'][0].isnull()
#if len(df3.loc[0,'RecentDelays'])==0:
#    print("Empty")
#else:
 #   print("Not empty")


df3.RecentDelays = df3.RecentDelays.apply(lambda y: np.nan if len(y)==0 else y)

In [14]:
df3

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055           NaN    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

In [13]:
# there are several ways to do this, but the following approach is possibly the simplest

delays = df3['RecentDelays'].apply(pd.Series)

delays.columns = ['delay_{}'.format(n)
 for n in range(1, len(delays.columns)+1)]

newdf = df3.drop('RecentDelays', axis=1).join(delays)

newdf

,FlightNumber,Airline,From,To,delay_1,delay_2,delay_3
0,10045,KLM(!),London,Paris,23.0,47.0,NaN
1,10055,<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,10065,(British Airways. ),London,Stockholm,24.0,43.0,87.0
3,10075,12. Air France,Budapest,Paris,13.0,NaN,NaN
4,10085,"""Swiss Air""",Brussels,London,67.0,32.0,NaN

In [26]:
"""5. In the RecentDelays column, the values have been entered into the
DataFrame as a list. We would like each first value in its own column, each
second value in its own column, and so on. If there isn't an Nth value, the value
should be NaN.
"""
#df3["RecentDelays"].iloc[0][0]

a=range(len(df3["RecentDelays"]))
p=list()
q=list()
r=list()
for item in df3["RecentDelays"]:
    #try:
    if len(df3.loc[a,'RecentDelays'])==2:
        print("in if loop")
        p.append(item[0])
        q.append(item[1])
        print(p)
            #r.append(item[2])
             
        #elif len(df3.loc[a,'RecentDelays'])==2:
         #   p.append(item[0])
          #  q.append(item[1])
            #r.append("NAN")
        
       # elif len(df3.loc[a,'RecentDelays'])==1:
        #    p.append(item[0])   
            #q.append("NAN")
            #r.append("NAN")
        
 #   except:
        
  #      continue
        
#print(p)
#print(q)
#print(r)

    #for i in item:
     #   print(i)


#df3
#df4=df3
#df4
#new2=df4["RecentDelays"][0].split()
#new2
#new1=list()
#for item in df3["RecentDelays"]:
#    new1.append()=df3["RecentDelays"].split

In [71]:
for item in df3["RecentDelays"]:
    #new1.append()=df3["RecentDelays"].split
    #print(item)
    for i in item:
        #print(i)
        if df3["RecentDelays"][item].isna()==True:
            print("Nothing")
        else:
            print(i)

KeyError: "None of [Int64Index([23, 47], dtype='int64')] are in the [index]"

In [67]:
newdf1=pd.DataFrame({'From':[], 'To':[]})
newdf1
i=range(len(df3['From_To']))
g=range(0,1)
for items in d1:
    #newdf1['From'].iloc[i]=d1[i][0]
    #newdf1['To'].iloc[i]=d1[i][1]
    newdf1['From'].append(d1[0][0])
    newdf1['To'].append(d1[0][1])
newdf1

TypeError: cannot concatenate object of type '<class 'str'>'; only Series and DataFrame objs are valid

In [56]:
a=range(len(df['FlightNumber']))
a
for i in a:
    df2.iloc[:,1][i]=df2['FlightNumber'][0]+(i*10)
print(df2)

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  after removing the cwd from sys.path.

In [57]:
df2

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

range(0, 5)

In [38]:
df.isnull()
df.iloc[:,1]
for i in df1.iloc[:,1]:
    print(i)
    a=range(len(df1))
    print(a)
df1['FlightNumber'][0]=10045
df1

10046.0
range(0, 5)
nan
range(0, 5)
10065.0
range(0, 5)
nan
range(0, 5)
10085.0
range(0, 5)

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  import sys

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [17]:
df
df2=df
df2

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [52]:
df2=df
df2
df3=list()
df2[['FlightNumber']]
r=df2['FlightNumber'][0]
r
p=range(len(df2['FlightNumber']))
for i in df2['FlightNumber']:
    for p in range(len(df2['FlightNumber'])):
        if i!='NaN':
            i=i
        else:
            i=(df2['FlightNumber'][p-1]+10)
            print(i)
df2

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [11]:
for i in df2.iloc[:,1]:
    for b in range(len(df1)):
        df2.iloc[:,1].fillna(df2.iloc[:,1][0]+(b*10), inplace=True) 
    print(b,i)

4 10045.0
4 10045.0
4 10065.0
4 10045.0
4 10085.0

In [ ]:
for p in range(len(df2)):
    if df2.iloc[:,1].isnull()==True:
        df2.iloc[:,1].fillna(df2.iloc[:,1][0]+(p*10), inplace=True) 
        print(p,i)

In [54]:
df1.iloc[:,1].fillna(0, inplace=True)
df1.iloc[:,1]

0    10045.0
1        0.0
2    10065.0
3        0.0
4    10085.0
Name: FlightNumber, dtype: float64

In [63]:
df2=df
df2

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [57]:
df2=df
#df1['FlightNumber']=df1['FlightNumber'].astype('int')
df1.dtypes

From_To          object
FlightNumber    float64
RecentDelays     object
Airline          object
dtype: object

In [49]:
df1['FlightNumber']=df1['FlightNumber'].fillna(value=10055)
df1.replace(df1.iloc[3,1], 10075)
df1

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10055.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [40]:
b=df1.index
list(b)
w=next(df1.iterrows())
w
#for i in next(df1['FlightNumber'].iterrows()): #print(i)

(0,
 From_To         LoNDon_paris
 FlightNumber           10045
 RecentDelays        [23, 47]
 Airline               KLM(!)
 Name: 0, dtype: object)

In [15]:
def R(z):
    for i in z:
        x=z[i]+10
        print(x)
R(list(int(df1['FlightNumber'])))
#df1.FlightNumber

TypeError: cannot convert the series to <class 'int'>